# Loan Status

## 1. Overview

## 2. Import libraries

In [1]:
import pandas as pd

## 3. Load the dataset

In [5]:
df = pd.read_csv("loan_data.csv")

## 4. Explore the dataframe

### 4.1. Display first five rows

In [7]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
1,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
2,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y

### 4.2. Shape of the dataframe

In [9]:
df.shape

(381, 13)

### 4.3. Dataframe basic information

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 381 entries, 0 to 380
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            381 non-null    object
 1   Gender             376 non-null    object
 2   Married            381 non-null    object
 3   Dependents         373 non-null    object
 4   Education          381 non-null    object
 5   Self_Employed      360 non-null    object
 6   ApplicantIncome    381 non-null    int64
 7   CoapplicantIncome  381 non-null    float64
 8   LoanAmount         381 non-null    float64
 9   Loan_Amount_Term   370 non-null    float64
 10  Credit_History     351 non-null    float64
 11  Property_Area      381 non-null    object
 12  Loan_Status        381 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 38.8+ KB

### 4.4. Statistical summary

In [13]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,381.000000,381.000000,381.000000,370.000000,351.000000
mean,3579.845144,1277.275381,104.986877,340.864865,0.837607
std,1419.813818,2340.818114,28.358464,68.549257,0.369338
min,150.000000,0.000000,9.000000,12.000000,0.000000
25%,2600.000000,0.000000,90.000000,360.000000,1.000000
50%,3333.000000,983.000000,110.000000,360.000000,1.000000
75%,4288.000000,2016.000000,127.000000,360.000000,1.000000
max,9703.000000,33837.000000,150.000000,480.000000,1.000000

## 5. Data cleaning

In [42]:
def wrangler(df):
    # Fill categorical missing values
    cat_cols = ["Gender", "Dependents", "Self_Employed"]
    for cat in cat_cols:
        df[cat] = df[cat].fillna(value=df[cat].mode()[0])

    # Fill numerical missing values
    num_cols = ["Loan_Amount_Term", "Credit_History"]
    for num in num_cols:
        df[num] = df[num].fillna(value=df[num].mode()[0])

    return df

### 5.1. Handle missing values

In [14]:
df.isnull().sum()

Loan_ID               0
Gender                5
Married               0
Dependents            8
Education             0
Self_Employed        21
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term     11
Credit_History       30
Property_Area         0
Loan_Status           0
dtype: int64

In [35]:
df = wrangler(df)

In [36]:
# The missing values are now filled using mode
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

### 5.2. Handle duplicates

In [40]:
df.duplicated().sum()

np.int64(0)

## 6. Data preprocessing

### 6.1 Convert categorical columns

In [46]:
df["Loan_Status"] = df["Loan_Status"].replace({1: 'Y', 0: 'N'})
df["Loan_Status"] = df["Loan_Status"].astype('object')

# df["Loan_Status"] = df["Loan_Status"].replace({'Y': 1, 'N': 0})
# df["Loan_Status"] = df["Loan_Status"].astype('int8')